---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenLoopError
source: html/2fa1b23e-fa0a-65c5-d8fd-3850c55051f7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenLoopError Property

Lines must be in closed loops. The highlighted lines are open on one end.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpenLoopError { get; }
```